{
    "info": {
        "eventName": "DevConf",
        "year": 2017,
        "about": "Acreditamos que o conhecimento é livre, e essa crença nos inspirou a organizar o DevConf! O DevConf é um evento de tecnologia sem fins lucrativos organizado pelo Opensanca, a maior comunidade ativa de tecnologia do interior de São Paulo, em parceria com a UFSCar e IFSP São Carlos. A proposta desta edição do evento é colocar em discussão temas atuais de tecnologia como Docker, Ionic, Agile, Microserviços, JavaScript, Clean Architecture e Programação Funcional. Iremos promover apresentações com alto nível de conhecimento e relevância e, estimular a troca de experiência e network entre a comunidade de tecnologia do interior, que é caipira mas ama e se move por tecnologia! O evento irá acontecer no dia 27 de Maio de 2017, no Anfiteatro Bento Prado da Universidade Federal de São Carlos (UFSCar) em São Carlos/SP. Esperamos um público aproximado de 200 pessoas, entre estudantes, profissionais de tecnologia e entusiastas da região!",
        "capacity": "200 DevCaipiras",
        "date": "Sábado - 27/05",
        "hour": "8:00 - 19:00",
        "place": "UFSCar - Anfiteatro Bento Prado",
        "sponsor_link": "https://docs.google.com/document/d/1hhKhEaR2tgLv3Br_uewAT6zf4LkqyCzFkUva1FEGxfM/edit?usp=sharing"
    },
    "albumLink": "https://www.flickr.com/photos/139126246@N02/sets/72157667646019409",
    "schedule": [
        {
            "time": "08:30 - 09:00",
            "title": "Credenciamento"
        },{
            "time": "08:30 - 09:00",
            "title": "Abertura"
        },{
            "time": "09:00 - 10:00",
            "title": "Escaping from the framework, guided by Clean Architecture",
            "record": "https://www.youtube.com/watch?v=FjXPwoW4sRw&t=0s&index=3&list=PLqmkdHCKvSKsP72xn8_StGZ7zGsLXzeqY",
            "slides": "https://goo.gl/sdGJ7g",
            "details": "Nessa palestra, nós vamos discutir causas e consequências do acoplamento de uma aplicação a frameworks / ferramentas, e como podemos \"descolar\" nosso sistema desses detalhes de implementação através de arquitetura de software.<br/> Arquitetura limpa - Clean Architecture - é um nome proposto pelo mito Uncle Bob Martin para descrever um estilo de projetar sistemas de maneira que o centro esteja naquilo que mais importa : aquilo que o software deve fazer - trazendo como benefícios manutenabilidade, extensibilidade, testabilidade e principalmente, independência em relação a peças que eventualmente podem ser substituídas.",
            "speaker": {
                "name": "Ubiratan Soares",
                "company": "luizalabs",
                "photo": "https://imgur.com/gOWQ8RQ.png",
                "priority": 2,
                "bio": "Ubiratan é Engenheiro de Software trabalhando diariamente com aplicações móveis desde 2010, com foco na criação de apps profissionais com performance e código robusto. Interessa-se também por Java e especialmente o ecossistema da JVM, incluindo Kotlin e Scala. Defensor de melhores práticas de desenvolvimento e programação reativa, foi nomeado em 2015 Google Developer Expert para Android e Intel Software Innovator em 2014.",
                "social": [
                    { "type": "twitter", "url": "https://twitter.com/ubiratanfsoares"},
                    { "type": "linkedin", "url": "https://br.linkedin.com/in/ubiratanfsoares"},
                    { "type": "github", "url": "https://github.com/ubiratansoares"}
                ]
            }
        },{
            "time": "10:00 - 10:45",
            "title": "Docker para desenvolvedores",
            "record": "https://www.youtube.com/watch?v=sTVSh_kH99U&t=0s&index=4&list=PLqmkdHCKvSKsP72xn8_StGZ7zGsLXzeqY",
            "slides": "https://goo.gl/gbGsnA",
            "details": "Porque todos os dev's deveriam utilizar Docker?<br/> Qual a diferença entre Containers (Docker) e Virtualização?<br/> Essas e outras questões sobre Docker, principalmente com foco no desenvolvedor serão abordadas.",
            "speaker": {
                "name": "Romulo Scampini",
                "photo": "https://imgur.com/neIaLkN.png",
                "company": "Touch Health",
                "bio": "Bacharel em Sistemas de Informação pela FIAP, desenvolvedor de software e DevOps, trabalha atualmente com Java, ecossistema JS, e principalmente Docker, Ansible e CI.",
                "social": [
                    { "type": "twitter", "url": "https://twitter.com/romuloscampini"},
                    { "type": "linkedin", "url": "https://www.linkedin.com/in/romuloscampini/"},
                    { "type": "github", "url": "https://github.com/romuloscampini"}
                ]
            }
        },{
            "time": "10:45 - 11:00",
            "title": "Coffe Break"
        },{
            "time": "11:00 - 12:00",
            "title": "Apps Mobile híbridas com Ionic 3",
            "record": "https://www.youtube.com/watch?v=f81SUi91fu0&t=0s&index=6&list=PLqmkdHCKvSKsP72xn8_StGZ7zGsLXzeqY",
            "slides": "https://goo.gl/MiQlwb",
            "details": "Ionic 3 é um framework open source para desenvolvimento de aplicativos mobile híbrido, onde se pode desenvolver o aplicativo usando HTML/CSS e JavaScript, fazer acesso nativo usando essas tecnologias e compilar o app para diferentes plataformas como iOS, Android e Windows Phone e publicá-lo nas respectivas app stores.<br/> O Ionic 3 é baseado em frameworks também open source e populares no mercado: Phonegap/Cordova, Angular e Sass (CSS).<br/>        Vamos aprender como criar um app em alguns minutos usando os principais conceitos do Angular como Módulos, Components, Templates, Diretivas e Serviços + RxJS Observables.",
            "speaker": {
                "name": "Loiane Groner",
                "company": "CitiBank",
                "priority": 1,
                "photo": "https://imgur.com/5R9jvCo.png",
                "bio": "Possui 10+ anos de experiência em TI, trabalha como desenvolvedora FullStack em uma empresa multinacional e ama compartilhar conhecimento! Já palestrou por vários eventos no Brasil e ministrou cursos nos Estados Unidos. Autora dos livros: Ext JS 4 First Look, Mastering Ext JS (primeira e segunda edição), Sencha Architect App Development e Learning JavaScript Data Structures and Algorithms (primeira e segunda edição), JavaScript Regular Expressions - todos publicados pela editora Packt e lançados mundialmente em inglês (com tradução de alguns livros para chinês e coreano). Espera poder lançar livros em Português em breve. Entusiasta Java, Sencha, Angular e mobile híbrido (Phonegap/Ionic). Participa ativamente dessas comunidades. Escreve para o blog http://loiane.com e publica aulas e cursos em http://loiane.training.",
                "social": [
                    { "type": "twitter", "url": "https://twitter.com/loiane"},
                    { "type": "linkedin", "url": "https://www.linkedin.com/in/loiane/"},
                    { "type": "github", "url": "https://github.com/loiane"}
                ]
            }
        },{
            "time": "12:00 - 14:00",
            "title": "Almoço"
        },{
            "time": "14:00 - 15:00",
            "title": "Porque investir em programação funcional",
            "record": "https://www.youtube.com/watch?v=PqjQZWsbmrU&t=0s&index=9&list=PLqmkdHCKvSKsP72xn8_StGZ7zGsLXzeqY",
            "slides": "https://goo.gl/VNZMBo",
            "details": "O Objetivo desta palestra é apresentar a programação funcional em elixir e porque deve investir.",
            "speaker": {
                "name": "Alex Ferreira",
                "priority": 3,
                "photo": "https://imgur.com/eDxb8DU.png",
                "company": "Locaweb",
                "bio": "Alex Ferreira @LocaWeb, Full Stack é apaixonado por Desenvolvimento e Fotografia. Começou a programar com 15 anos, passou por diversas linguagens server-side como PHP, Java, Ruby, NodeJS, Elixir. Como frontend já trabalhou com Angular, Backbone, Knockout e EmberJs. Atualmente adota como ferramenta principal  de desenvolvimento de aplicações o NodeJs ou Elixir e para front o EmberJs."
            }
        },{
            "time": "15:00 - 16:00",
            "title": "Evolução do JavaScript",
            "record": "https://www.youtube.com/watch?v=cw_Eo6fADdA&t=0s&index=5&list=PLqmkdHCKvSKsP72xn8_StGZ7zGsLXzeqY",
            "slides": "https://goo.gl/bm6VYt",
            "details": "Atualmente estamos cada dia mais conectado a aplicações dinâmicas e interativas e tudo isso graças a evolução da internet que tem sido muito intesa.<br/>  O Javascript tem sido uma linguagem fundamental para essa evolução e a cada dia está mais presente em nossas vidas, queira ou não queira.<br/>        Essa palestra abordará toda evolução do Javascript desde o DHTML até os dias atuais onde temos Javascript no servidor, mostrando assim todo o seu poder atuamente e como será o seu futuro.",
            "speaker": {
                "name": "Pedro Barros",
                "company": "Programmer's",
                "photo": "https://imgur.com/6qzhCWI.png",
                "bio": "Pedro atua como desenvolvedor Web há mais de 6 anos, apaixonado por JavaScript, escreve nas horas vagas, já trabalhou em projetos de clientes como UOL, Royal Canin, Press Ganey e outros.",
                "social": [
                    { "type": "twitter", "url": "http://twitter.com/pedrobarrostech"},
                    { "type": "linkedin", "url": "https://www.linkedin.com/in/pedro-augusto-de-barros-3a8191a0"},
                    { "type": "github", "url": "http://github.com/pedrobarrostech"}
                ]
            }
        },{
            "time": "16:00 - 16:30",
            "title": "Coffe Break"
        },{
            "time": "16:30 - 17:30",
            "title": "Microserviços o mal do século XXI na criação de empresas",
            "record": "https://www.youtube.com/watch?v=poCyTwHOirw&t=0s&index=7&list=PLqmkdHCKvSKsP72xn8_StGZ7zGsLXzeqY",
            "slides": "https://goo.gl/U0Cp0v",
            "details": "Palestra irá apresentar o por que não se deve iniciar a criação de um sistema com microserviços, quando se está iniciando uma empresa. Hoje em dia essa arquitetura é altamente utilizada mas sem haver a necessidade com isso muitas empresas acabam quebrando sem ter o seu produto lançado.",
            "speaker": {
                "name": "Gustavo Pereira",
                "priority": 6,
                "photo": "https://imgur.com/mSpiIv3.png",
                "company": "Academia PME",
                "bio": "Um apaixonado por tecnologia e negócios. Com experiências em várias linguagens e tecnologias, passando por diversas empresas como HP e UOL, atualmente é CTO e CO-Founder da Academia PME, onde usa tecnologia para transformar negócios, com estudos de casos de empreendedores.",
                "social": [
                    { "type": "twitter", "url": "https://www.twitter.com/gstpreira"},
                    { "type": "linkedin", "url": "https://www.linkedin.com/in/gstpreira/"},
                    { "type": "github", "url": "https://github.com/gstpreira"}
                ]
            }
        },{
            "time": "17:30 - 18:30",
            "title": "Gerenciando o roadmap do seu produto com MVP Canvas",
            "record": "https://www.youtube.com/watch?v=QagLGev0swE&t=0s&index=8&list=PLqmkdHCKvSKsP72xn8_StGZ7zGsLXzeqY",
            "slides": "https://goo.gl/mnuwY2",
            "details": "Nesta palestra vamos entender como mapear as features baseadas na jornada do usuário,  de forma a lançar um produto que seja aderente exatamente ao que o usuário necessita para ter feedback baseado na experiência real do usuário.",
            "speaker": {
                "name": "Carlos Rodrigues",
                "photo": "https://i.imgur.com/YRqQmWM.png",
                "priority": 4,
                "company": "FCamara",
                "bio": "Hoje sou Arquiteto de Soluções do High Performance Team da FCamara, após passar por empresas como Ericsson e IBM e Odebrecht. Entusiasta do mundo JavaScript já atuei em projetos com todas as versões do Angular, Ionic, NodeJS, mas também possuo bastante experiência na plataforma .Net. Ultimamente tenho atuado liderando equipes na construção de produtos inovadores utilizando MVP Canvas, Lean Startup e Design Thinking. Também participo ativamente do programa de formação de novos consultores da FCamara e tenho palestrado regularmente em eventos importantes de tecnologia pelo Brasil afora.",
                "social": [
                    { "type": "twitter", "url": "https://twitter.com/carlossj"},
                    { "type": "linkedin", "url": "https://www.linkedin.com/in/carlosrodriguesjunior/"}
                ]
            }
        },{
            "time": "18:30 - 19:30",
            "title": "Separando uma aplicação monolítica",
            "record": "https://www.youtube.com/watch?v=zITW78O70AA&t=1s&index=2&list=PLqmkdHCKvSKsP72xn8_StGZ7zGsLXzeqY",
            "slides": "https://goo.gl/tkbWFB",
            "details": "Objetivo desta proposta é apresentar como estudo de caso o trabalho em andamento no CasaeCafe.com para separar uma aplicação monolítica. Estaremos vendo sobre Problemas de escalabilidade em aplicações monolíticas, quando separar o monolito e soluções de arquitetura, trocando a roda com o carro em movimento, como executar essa transição, principais dificuldades e resultados obtidos",
            "speaker": {
                "name": "Rafael Girolineto",
                "priority": 5,
                "photo": "https://imgur.com/hc2CTfN.png",
                "company": "Casa e Café",
                "bio": "Formado em Engenharia da Computação e com quase uma década de experiência no mercado de tecnologia, trabalhou no desenvolvimento de sistemas nas áreas de Telecom, Mobile e Plataformas Web. Atuou ativamente no desenvolvimento e manutenção de diversos sistemas de tempo real com dezenas de milhões de usuários, transitando desde posições técnicas até áreas de negócio, gerenciando times e contas de clientes. Atualmente aplica todo o conhecimento adquirido na startup CasaeCafe.com, onde atua como líder técnico.",
                "social": [
                    { "type": "twitter", "url": "https://twitter.com/rafakareka"},
                    { "type": "linkedin", "url": "https://www.linkedin.com/in/girolineto/"},
                    { "type": "github", "url": "https://github.com/rafapg"}
                ]
            }
        }, {
            "time": "19:30 - 00:00",
            "title": "After Party @BlackBird"
        }
    ],
    "sponsors": {
        "diamond": [
            { "name": "Monitora", "link": "http://monitoratec.com.br/pt", "logo": "/assets/img/logos/monitora.png"},
            { "name": "Lendico", "link": "https://www.lendico.com.br/", "logo": "/assets/img/logos/lendico.svg"},
            { "name": "S2it", "link": "https://s2it.com.br/", "logo": "/assets/img/logos/s2it.png"},
            { "name": "Fast Track", "link": "http://ft.ventures/", "logo": "/assets/img/logos/fast-track.png"}
        ],
        "gold": [
            { "name": "FCamara", "link": "https://www.fcamara.com.br/", "logo": "/assets/img/logos/fcamara.png"},
            { "name": "Guarani", "link": "http://www.guaranisistemas.com.br/", "logo": "/assets/img/logos/guarani.svg"},
            { "name": "Innovaci", "link": "#", "logo": "/assets/img/logos/innovaci.svg"},
            { "name": "Simples", "link": "http://simples.software/", "logo": "/assets/img/logos/simples.png"},
            { "name": "TopTal", "link": "https://www.toptal.com/", "logo": "/assets/img/logos/toptal.svg"}
        ],
        "silver": [],
        "bronze": [
            { "name": "Luiza Labs", "link": "http://luizalabs.com/", "logo": "/assets/img/logos/luiza-labs.png"}
        ]
    },
    "partners": [
        { "name": "Casa do Código", "link": "http://casadocodigo.com.br", "logo": "/assets/img/logos/casadocodigo.png"},
        { "name": "Algaworks", "link": "http://www.algaworks.com/", "logo": "/assets/img/logos/algaworks.png"},
        { "name": "IFSP", "link": "http://www.ifspsaocarlos.edu.br/portal/", "logo": "/assets/img/logos/logo-ifsp.png"},
        { "name": "UFSCar", "link": "http://www2.ufscar.br/", "logo": "/assets/img/logos/logo-ufscar.png"}
    ]
}
