{
  "info": {
    "eventName": "DevConf",
    "year": 2018,
    "title": "DevConf 2018 | Somos caipiras e gostamos de tecnologia!",
    "about": "Acreditamos que o conhecimento é livre, e essa crença nos inspirou a organizar o DevConf! O DevConf é um evento de tecnologia sem fins lucrativos organizado pelo Opensanca, a maior comunidade ativa de tecnologia do interior de São Paulo, em parceria com a UFSCar e IFSP São Carlos. A proposta desta edição do evento é colocar em discussão temas atuais de tecnologia e desenvolvimento de software. Iremos promover apresentações com alto nível de conhecimento e relevância e, estimular a troca de experiência e network entre a comunidade de tecnologia do interior, que é caipira mas ama e se move por tecnologia! O evento irá acontecer no dia 05 de Maio de 2018, no Anfiteatro Bento Prado da Universidade Federal de São Carlos (UFSCar) em São Carlos/SP. Esperamos um público aproximado de 200 pessoas, entre estudantes, profissionais de tecnologia e entusiastas da região!",
    "capacity": "180 DevCaipiras",
    "date": "Sábado - 05/05",
    "hour": "8:00 - 19:00",
    "place": "UFSCar - Anfiteatro Bento Prado",
    "sponsor_link": "documento_de_patrocinio_devconf_2018.pdf",
    "tickets": {
      "available": false,
      "message": "Ingressos esgotados. Ano que vem tem mais!"
    }
  },
  "albumLink": "https://www.facebook.com/pg/opensanca/photos/?tab=album&album_id=1059486360881118",
  "pastEditions": [
    {
      "title": "DevConf 2017",
      "link": "http://2017.devconf.com.br/"
    }
  ],
  "sympla": {
    "id":"sympla-widget-233687",
    "script":"https://www.sympla.com.br/js/sympla.widget-pt.js/233687"
  },
  "schedule": [
    {
      "time": "08:00 - 08:30",
      "title": "Credenciamento"
    },
    {
      "time": "08:30 - 08:40",
      "title": "Abertura"
    },
    {
      "time": "08:40 - 09:20",
      "title": "Cultura de Desenvolvimento e Arquitetura do Stack Overflow",
      "record": "https://www.youtube.com/watch?v=7LEWQZim5O4&index=2&t=4s&list=PLoxsuhBe-jd-xwXzgYxy93UWgZO7J_6xp",
      "slides": "",
      "details": "Boas práticas de desenvolvimento de software são comumente aceitas como universais; entretanto, no Stack Overflow, estamos acostumados a desobedecer convenções e quebrar paradigmas. Conseguimos manter no ar uma rede de sites que recebe 1 bilhão e meio de page views por mês usando apenas 9 servidores web. Nossa arquitetura é monolítica, usamos nosso próprio data center, mais da metade do nosso time trabalha remotamente (e em diferentes fusos), não escrevemos testes automatizados e frequentemente reinventamos rodas. Nossa obsessão por performance gerou vários projetos open source interessantes, e permitiu que tivéssemos uma infra estrutura até vinte vezes mais enxuta que sites de tamanho similar, além de ter nos ajudado a lidar com o Meltdown. Nessa palestra vou falar da nossa cultura de desenvolvimento, explicar como funciona nossa arquitetura e as motivações por trás de tantas escolhas controversas.",
      "speaker": {
        "name": "Roberta Arcoverde",
        "company": "Stack Overflow",
        "photo": "assets/img/2018_roberta_arcoverde.png",
        "priority": 1,
        "bio": "Sou desenvolvedora há 12 anos, recifense morando em São Paulo, mestre em informática pela PUC-Rio e bacharela em ciência da computação pela UFPE. Há quatro anos integro o time de desenvolvedores da Stack Overflow, trabalhando remotamente no desenvolvimento do grupo de mais de 140 sites que compõem a Stack Exchange Network. Embora seja oficialmente desenvolvedora full-stack, tenho um carinho especial por back-end.",
        "social": [
          { "type": "twitter", "url": "https://twitter.com/rla4"},
          { "type": "linkedin", "url": "https://br.linkedin.com/in/robertaarcoverde"},
          { "type": "github", "url": "https://github.com/robertaarcoverde"}
        ]
      }
    },
    {
      "time": "09:20 - 10:00",
      "title": "Como sua aplicação deve se comportar quando tudo dá errado?",
      "record": "https://www.youtube.com/watch?v=qsP4YNNXPj4&index=3&t=1s&list=PLoxsuhBe-jd-xwXzgYxy93UWgZO7J_6xp",
      "slides": "",
      "details": "O objetivo dessa palestra é compartilhar experiências recentes lidando com APIs com alto throughput, falhas de comunicação entre componentes, bancos de dados, serviços externos, etc.<br/><br/>Nós iremos explorar aplicações do mundo real do meu dia a dia e veremos algumas soluções como Circuit Breakers, Cache Stale, Service Mesh e outras coisas que podem garantir a resiliência e uptime do seu serviço.<br /><br />Iremos também cobrir algumas questões de como a aplicação deve se comportar quando: O banco de dados não está disponível; Alguns serviços externos estão quebrados ou com um tempo de resposta não aceitável; Rede está falhando por algum motivo.",
      "speaker": {
        "name": "Emerson Macedo",
        "company": "Olx",
        "photo": "assets/img/2018_emerson_macedo.jpeg",
        "priority": 2,
        "bio": "Problem solver. Programador apaixonado. Meu objetivo é sempre buscar como posso agregar valor para alguém. 19 anos trabalhando profissionalmente, trabalhei para portais web, seguradoras, telecomunicações, bancos, entre outros. Programador agnóstico.",
        "social": [
          { "type": "twitter", "url": "https://twitter.com/emerleite" },
          { "type": "linkedin", "url": "https://br.linkedin.com/in/emerleite" },
          { "type": "github", "url": "https://github.com/emerleite" }
        ]
      }
    },
    {
      "time": "10:00 - 10:30",
      "title": "Coffee Break"
    },
    {
      "time": "10:30 - 11:10",
      "title": "Criando um chatbot para automação de tarefas",
      "record": "https://www.youtube.com/watch?v=8r0d96eB7gM&index=4&t=0s&list=PLoxsuhBe-jd-xwXzgYxy93UWgZO7J_6xp",
      "slides": "",
      "details": "Venha conhecer mais sobre chatbots e como eles podem ser útil na automação de atividades! <br /> Vamos integrar tudo e demonstrar como tudo é mais simples do que parece, seu bot funcional em 30 minutos, eu garanto! <br /> Iremos construir um bot que irá interagir com o usuário e já realizar ações que antes era manual, no nosso exemplo, nosso bot irá realizar uma troca de senha para o usuário, tudo automático, sem intervenção humana, mas com uma interação que irá simular um humano. <br /> Iremos fazer tudo isso, criando uma inteligência usando o IBM Watson, onde iremos integrar com um Client feito em Python/Django, que será responsável pelas ações (como a troca de senha) e também será responsável por receber a repassar a mensagem para nosso Bot no Telegram! =D <br /> E se você não programa em Python, fique tranquilo, vou demonstrar como você pode fazer tudo isso na linguagem de sua preferência! =D",
      "speaker": {
        "name": "Rafael Galleani",
        "company": "Global Hitss",
        "photo": "assets/img/2018_rafael_galleani.jpg",
        "priority": 3,
        "bio": "Desenvolvedor full-stack, apaixonado por tecnologia e outras modinhas. Tenho 10 anos de experiência, após ter feito de tudo na área, nos últimos anos tenho me dedicado a cultura DevOps, Python e Chatbot. Também mantenho um blog e um canal no youtube.",
        "social": [
          { "type": "twitter", "url": "https://twitter.com/rafegal" },
          { "type": "linkedin", "url": "https://br.linkedin.com/in/rafael-galleani/" },
          { "type": "github", "url": "https://github.com/rafegal" }
        ]
      }
    },
    {
      "time": "11:10 - 11:50",
      "title": "Arquitetura Hexagonal",
      "record": "https://www.youtube.com/watch?v=aiPVE6nXYTs&index=10&t=2s&list=PLoxsuhBe-jd-xwXzgYxy93UWgZO7J_6xp",
      "slides": "",
      "details": "Todo mundo fica frustrado quando demora muito mais do que deveria para entregar uma funcionalidade que era pra ser simples. Pra resolver esse problema (e outros) é que surge a Arquitetura Hexagonal, também conhecida como Ports & Adapters, cujo objetivo é minimizar o trabalho de criar ou fazer modificações em um software. Essa talk irá apresentar o que é essa arquitetura, por que ela existe e como ela funciona, passando por todo o caminho que um recurso faz no software.",
      "speaker": {
        "name": "Camila Campos",
        "company": "Creditas",
        "photo": "assets/img/2018_camila_campos.jpg",
        "priority": 4,
        "bio": "Formada em Sistemas de Informação na EACH-USP, a chata dos testes que trabalha como engenheira de software na Creditas e organiza o Rails Girls São Paulo e o Women Dev Summit.",
        "social": [
          { "type": "twitter", "url": "https://twitter.com/camposmilaa" },
          { "type": "linkedin", "url": "https://www.linkedin.com/in/camilacamposramos/" },
          { "type": "github", "url": "https://github.com/camilacampos" }
        ]
      }
    },
    {
      "time": "11:50 - 14:00",
      "title": "Almoço"
    },
    {
      "time": "14:00 - 14:40",
      "title": "Criando animações avançadas com Greensock",
      "record": "https://www.youtube.com/watch?v=6DJz0vek9Fo&index=6&t=0s&list=PLoxsuhBe-jd-xwXzgYxy93UWgZO7J_6xp",
      "slides": "",
      "details": "Também nunca ouviu falar em Greensock? Ficaria surpreendido se eu dissesse que mais da metade dos sites premiados de 2017 usaram essa biblioteca? Pois é, vamos aprender e conhecer essa incrível biblioteca de animações!",
      "speaker": {
        "name": "Willian Justen",
        "company": "Toptal",
        "photo": "assets/img/2018_willian_justen.jpeg",
        "priority": 5,
        "bio": "Desenvolvedor Front-end na Toptal, escritor de blog nas horas vagas e instrutor de cursos na Udemy com mais de 30 mil alunos. Sou apaixonado por tecnologia e compartilhamento de conhecimento, nos últimos tempos tenho me dedicado a criação de cursos, discussões sobre trabalho remoto e fotografia, onde acabei ganhando prêmio de fotógrafo de 2017 pelo Unsplash.",
        "social": [
          { "type": "twitter", "url": "https://twitter.com/willian_justen"},
          { "type": "linkedin", "url": "https://br.linkedin.com/in/willianjusten"},
          { "type": "github", "url": "https://github.com/willianjusten"}
        ]
      }
    },
    {
      "time": "14:40 - 15:20",
      "title": "Raciocinando sobre sistemas distribuídos",
      "record": "https://www.youtube.com/watch?v=sDA44slJbl4&index=7&t=3s&list=PLoxsuhBe-jd-xwXzgYxy93UWgZO7J_6xp",
      "slides": "",
      "details": "Aplicações distribuidas estão cada vez mais comuns no dia a dia dos desenvolvedores: Seja devido à adoção de arquiteturas orientadas a ~micro~serviços, single page applications, aplicações mobile, etc.<br />Dado esse caminho sem volta, é fundamental que nós, desenvolvedores, sejamos capazes de raciocinar sobre tais sistemas e entender onde a nossa lógica geralmente baseada em sistemas monolíticos começa a falhar.<br /> Nessa apresentação vamos abordar temas como consistência, disponibilidade, deploy, arquiteturas de dados, redes, relógios, testes, performance e explorar *por que* esses assuntos merecem ser compreendidos (e como eles podem tirar nosso sono).",
      "speaker": {
        "name": "Renan Ranelli",
        "company": "Telnyx LLC",
        "photo": "assets/img/2018_renan_ranelli.jpeg",
        "priority": 6,
        "bio": "Sou engenheiro de software focando em backend e banco de dados, nos ultimos 2 anos trabalhei com Elixir, Clojure e Python. Antes disso, passei longas temporadas no ecossistema Ruby e C#. Já trabalhei em projetos grandes, pequenos, legados e novos. Em uma vida passada fui Engenheiro Químico.",
        "social": [
          { "type": "twitter", "url": "https://twitter.com/renanranelli"},
          { "type": "linkedin", "url": "https://br.linkedin.com/in/renan-ranelli"},
          { "type": "github", "url": "https://github.com/rranelli"}
        ]
      }
    },
    {
      "time": "15:20 - 16:00",
      "title": "Ciência de dados no mundo real com Serenata de Amor",
      "record": "https://www.youtube.com/watch?v=00dDVJJvGCc&index=8&t=2s&list=PLoxsuhBe-jd-xwXzgYxy93UWgZO7J_6xp",
      "slides": "",
      "details": "É possível fazer ciências de dados no mundo real? Conheça mais sobre a Serenata de Amor, projeto que enfrentou todas as dificuldades de lidar com dados abertos governamentais e mostrou que é possível identificar gastos irregulares dos nossos deputados utilizando dos dados abertos e muito Python.",
      "speaker": {
        "name": "Jessica Temporal",
        "company": "Nuveo",
        "photo": "assets/img/2018_jessica_temporal.png",
        "priority": 7,
        "bio": "Desenvolvedora e cientista de dados na Nuveo, co-fundadora do podcast brasileiro sobre ciência de dados o Pizza de Dados, PyLady e também mantenedora do projeto Operação Serenata de Amor. Formou-se sem Informática Biomédica onde descobriu a paixão por ciência de dados analisando dados genômicos e flertando com processamento de linguagem natural durante a graduação.",
        "social": [
          { "type": "twitter", "url": "https://twitter.com/jesstemporal"},
          { "type": "linkedin", "url": "https://br.linkedin.com/in/jessicatemporal"},
          { "type": "github", "url": "https://github.com/jtemporal"}
        ]
      }
    },
    {
      "time": "16:00 - 16:30",
      "title": "Coffee Break"
    },
    {
      "time": "16:30 - 17:10",
      "title": "Os tipos escondidos na sua UI",
      "record": "https://www.youtube.com/watch?v=2Ek0Ep0fB9Y&index=5&t=0s&list=PLoxsuhBe-jd-xwXzgYxy93UWgZO7J_6xp",
      "slides": "",
      "details": "Tipos estão escondidos mesmo nas UIs mais simples. Dados a carregar, listas de conteúdo, status da conexão e muitos outros que nem sempre são explícitos. Usando exemplos de UIs reais, eu o/a ajudarei a desvendá-los, evitando assim problemas inesperados em runtime.",
      "speaker": {
        "name": "Hugo Bessa",
        "company": "Toptal",
        "photo": "assets/img/2018_hugo_bessa.jpeg",
        "priority": 8,
        "bio": "Desenvolvedor front-end com foco em simplicidade. Há 4 anos lutando contra problemas de tipos e outros monstros desconhecidos.",
        "social": [
          { "type": "twitter", "url": "https://twitter.com/hugobessaa"},
          { "type": "linkedin", "url": "https://br.linkedin.com/in/hugobessa"},
          { "type": "github", "url": "https://github.com/hugobessaa"}
        ]
      }
    },
    {
      "time": "17:10 - 17:50",
      "title": "Código simples: Navalha de Occam para desenvolvedores",
      "record": "https://www.youtube.com/watch?v=3ZVPRxUI9q8&index=9&t=5s&list=PLoxsuhBe-jd-xwXzgYxy93UWgZO7J_6xp",
      "slides": "",
      "details": "Hoje muitas ferramentas/linguagens para desenvolvimento de software fornecem uma facilidade tão grande que alguns desenvolvedores conseguem inserir complexidade onde era simples. Vamos discutir essas práticas de complexidade desnecessária, seja no código, seja na infraestrutura, seja no modo de pensar onde ainda algumas vezes perdura um sentimento de que a complexidade estaria associada á código mais 'profissional' ou 'hacker', quando as soluções mais simples se mostram cada vez mais melhores para desenvolvimento de software a curto, médio e longo prazo.",
      "speaker": {
        "name": "Eustáquio Rangel (Taq)",
        "company": "Bluefish",
        "photo": "assets/img/2018_taq.jpeg",
        "priority": 9,
        "bio": "Desenvolvedor na área por mais de 2 décadas, programa em várias linguagens e é entusiasta de Software Livre, do qual é mantenedor de vários projetos, e autor de tutoriais de Ruby e Rails e do primeiro livro de Ruby do Brasil. Também publica ebooks sobre Ruby, Rails e Git.\nSócio e desenvolvedor na empresa Bluefish, que trabalha com consultoria, treinamento e desenvolvimento utilizando apenas soluções de Software Livre.",
        "social": [
          { "type": "twitter", "url": "https://twitter.com/taq" },
          { "type": "linkedin", "url": "https://www.linkedin.com/in/eustaquio-rangel-de-oliveira-jr-a446a328/" },
          { "type": "github", "url": "https://github.com/taq" }
        ]
      }
    },
    {
      "time": "17:50 - 18:30",
      "title": "Mesa redonda",
      "record": "https://www.youtube.com/watch?v=pYWHZXXtAEg&index=11&t=899s&list=PLoxsuhBe-jd-xwXzgYxy93UWgZO7J_6xp"
    },
    {
      "time": "18:30 - 19:00",
      "title": "Encerramento"
    }
  ],
  "sponsors": {
    "diamond": [
      { "name": "S2it", "link": "https://s2it.com.br/", "logo": "/assets/img/logos/s2it.png"},
      { "name": "Fast Track", "link": "http://ft.ventures/", "logo": "/assets/img/logos/fast-track.png"},
      { "name": "Monitora", "link": "http://monitoratec.com.br/", "logo": "/assets/img/logos/monitora.png"},
      { "name": "Serasa Experian", "link": "https://www.serasaexperian.com.br/", "logo": "/assets/img/logos/serasaexperian.png"}
    ],
    "gold": [
      { "name": "Programer's", "link": "http://www.programmers.com.br", "logo": "/assets/img/logos/programers.png"}
    ],
    "bronze": [
      { "name": "ContaAzul", "link": "https://contaazul.com.br", "logo": "/assets/img/logos/logo_contaazul.png"}
    ]
  },
  "partners": [
    { "name": "IFSP", "link": "http://www.ifspsaocarlos.edu.br/portal/", "logo": "/assets/img/logos/logo-ifsp.png" },
    { "name": "UFSCar", "link": "http://www2.ufscar.br/", "logo": "/assets/img/logos/logo-ufscar.png" },
    { "name": "InfoQ Brasil", "link": "https://www.infoq.com/br/", "logo": "/assets/img/logos/infoqbrasil-logo.png" },
    { "name": "Algaworks", "link": "http://www.algaworks.com/", "logo": "/assets/img/logos/algaworks.png" },
    { "name": "Alura", "link": "http://www.alura.com.br/", "logo": "/assets/img/logos/alura.png" },
    { "name": "Casa do Código", "link": "http://www.casadocodigo.com.br/", "logo": "/assets/img/logos/casa-do-codigo.png" },
    { "name": "Egghead", "link": "http://www.egghead.io/", "logo": "/assets/img/logos/egghead.png" },
    { "name": "OLX", "link": "http://www.olx.com.br/", "logo": "/assets/img/logos/olx.png" },
    { "name": "Treina Web", "link": "https://www.treinaweb.com.br/", "logo": "/assets/img/logos/treina-web.png" }
  ]
}
